[
    {
    "title": "A novel VOC mixtures classification methods based on GBLinear and TabNet and Informative Feature Selection",
    "authors": "Hamed Karami, Abdolrahman Khoshrou",
    "type": "journal",
    "venue": "Talanta",
    "volume": "297",
    "pages": "",
    "year": "2025",
    "date": "2025-07-01",
    "publisher": "Elsevier",
    "doi": "https://doi.org/10.1016/j.talanta.2025.128554",
    "abstract": "The GBLinear and TabNet algorithms have been incorporated with essential feature selection techniques to create a new method of classifying essential oils using e-nose systems. Essential oils, known for their complex chemical compositions and a wide variety of applications in industries such as food, cosmetics, and pharmaceuticals, pose some challenges for e-nose systems due to the high variability and subtle differences in volatile compounds (VOCs). This novel approach, used for the first time for the analysis of electronic nose data, integrates efficient machine-learning models with advanced feature selection techniques and aims to increase the accuracy and interpretability of essential oil classification. This study highlights the potential of integrating interpretable machine learning models with deep learning-based architectures to address challenges in the analysis of complex gas mixtures. Not only was the classification accuracy increased by these methods, but these methods could be used in the future as promising models for analyzing complex mixtures."
  },
  {
    "title": "Singular value decomposition for time series analysis with applications to smart energy systems",
    "authors": "Abdolrahman Khoshrou",
    "type": "Dissertation (TU Delft)",
    "venue": "Doctor of Philosophy",
    "volume": "",
    "pages": "",
    "year": "2022",
    "date": "2022-12-19",
    "publisher": "Delft University of Technology",
    "doi": "10.4233/uuid:9bf59202-4b7a-4313-b972-c12b7d272c06",
    "abstract": "In a world replete with observations (physical as well as virtual), many data sets are represented by time series. In its simplest form, a time series is a set of data collected sequentially, usually at fixed intervals of time. In a number of applications, the mean and the variance of the time series is time-invariant and there is no seasonality in the data (such time series is called stationary). However, in many more applications, e.g., time series that are related to smart energy systems, the data have non-stationary characteristics. This thesis focuses primarily on matrices as an alternative representation of the latter type of time series, in order to take advantage of matrix decomposition methods. The rationale is straightforward: numerically stable matrix decomposition techniques enable us to extract underlying patterns in the data and use them to construct approximations of the corresponding time series. In particular, we will focus on singular value decomposition (SVD) as a powerful and numerically stable matrix factorization technique. Therefore, as the first step in this thesis, the SVD and its geometrical interpretation are extensively studied, in order to acquire a firm understanding of how it performs. That in turn enables us to look at different problems in time series analysis from a fresh perspective. For most of the applications of SVD in various fields, it is important to understand the properties of the SVD of a matrix whose entries show some degree of random fluctuations. Therefore, to determine how the noise level affects the singular value spectrum, it is essential to study the singular value decomposition of random matrices. As we will explain in the introductory chapter, one of the early applications of the SVD in time series analysis is in periodicity detection of the time series data. Therefore, we explore how the geometry of a matrix (the position of the data points with respect to the origin) and the aspect ratio of the matrix (the ratio between the number of columns and the number of rows) can affect its SVD results. Matrix factorisation techniques such as principal component analysis (PCA) and singular value decomposition (SVD) are both conceptually simple and effective. However, it is well-known that they are sensitive to the presence of noise and outliers in input data. One way to mitigate this sensitivity is to introduce regularisation. To this aim, we hark back to the interpretation of SVD and PCA in terms of low-rank approximations, which involve the minimisation of specific functionals. We then derive algorithms for the minimisation of the regularised version of such functionals. After the above-described theoretical investigations of SVD, we considered novel applications of SVD to various problems. The first one concerned challenges related to the integration of renewable energy sources (RES). With increasing RES-integration such as wind and solar energy to the power grid, balancing the grid has become more challenging. This is mostly due to the inherently intermittent nature of RES, on the one hand, and shortcomings in bulk energy storage systems, on the other. Therefore, studies on scenario-based probabilistic energy production and demand forecasts have gained momentum, as they are highly valuable from both a technical and an economic point of view. A particular application of such models in the energy sector is where having the distribution of energy consumption for the coming days is desired. Furthermore, as extensively argued in the literature, a decisive variable in predicting energy demand is temperature data. There are mainly three practical and popular methods for generating temperature scenarios, namely fixed-date, shifted-date, and bootstrap approaches. Nevertheless, these methods have mostly been used on an ad-hoc basis without being formally compared or quantitatively evaluated. Moreover, as we discuss, the performance of such models depends to a large extent on the quality of input data. Therefore, we propose a generic, data-driven and computationally efficient SVD-based approach to simulate temperature scenarios. The strength of our proposed method lies in its simplicity and robustness, in terms of the training window size, with no need for subsetting or thresholding in order to generate temperature scenarios. The empirical case studies performed on the data from the load forecasting track of the Global Energy Forecasting Competition 2014 (GEFCom2014-L) show that the proposed method outperforms the top two scenario-based models with a similar set-up. Another topic of considerable interest is to investigate what effect the transition of energy to RES can have on the overall trend and volatility of electricity prices. This impact could be complex because there are two contradicting forces at play. The marginal cost of RES is relatively low and even negative (especially if subsidized), therefore, increased penetration of wind and solar would result in a downward trend in electricity prices. Opposing this is the associated uncertainty regarding the availability of wind and solar energy, which causes spikes in the market. In other words, the integration of RES provokes assertions that the stability of the power grid can (surely) be compromised due to the inherent intermittency of such sources. Therefore, the increased price volatility will cause additional market risks for suppliers and consumers in the market. In the literature, numerous methods have been introduced to determine the volatility of the time series data. However, as we exemplify, the emergence of non-positive price values in the energy transition era has introduced new challenges in the electricity market volatility analysis. This new aspect of the market renders many traditional volatility indices ineffective. More precisely, the standard approach to switch to logarithmic measures can be done only after shifting up all values above zero by a certain threshold. On the other hand, price volatility has a dependence on the price level, which is even more pronounced when the spot prices are low. Therefore, the generalizability of conventional approaches is questioned, as the volatility measures can vary drastically, with respect to the magnitude of the aforementioned thresholds. We tackle this problem by introducing a new notion of volatility which is obtained by reconstructing the time series using the SVD technique. In other words, we detect and remove the deterministic part of the price data using the SVD and consider the stochastic part (residuals) as a notion of volatility. Using the matrix representation of the data, we then highlight the evidence of the effect of renewables on daily price profiles in the German day-ahead market, i.e., the emergence of non-positive prices and also shifts of peak price values to hours where solar is less available. Overall, in this thesis, we study in-depth the SVD technique and propose novel applications of it in time series analysis. Our findings can be used as innovative components of future smart grid systems, which are characterized by the increasing uncertainty on both the supply and demand parts."
  },
  {
    "title": "Regularisation for PCA-and SVD-type matrix factorisations",
    "authors": "Abdolrahman Khoshrou, Eric J Pauwels",
    "type": "arXiv",
    "venue": "arXiv preprint arXiv:2106.12955",
    "volume": "",
    "pages": "",
    "year": "2021",
    "date": "2021-11-01",
    "publisher": "",
    "doi": "arXiv:2106.12955",
    "abstract": "Singular Value Decomposition (SVD) and its close relative, Principal Component Analysis (PCA), are well-known linear matrix decomposition techniques that are widely used in applications such as dimension reduction and clustering. However, an important limitation of SVD/PCA is its sensitivity to noise in the input data. In this paper, we take another look at the problem of regularisation and show that different formulations of the minimisation problem lead to qualitatively different solutions."
  },
  {
    "title": "The evolution of electricity price on the German day-ahead market before and after the energy switch",
    "authors": "Abdolrahman Khoshrou, Andre B Dorsman, Eric J Pauwels",
    "type": "journal",
    "venue": "Renewable Energy",
    "volume": "134",
    "pages": "1--13",
    "year": "2019",
    "date": "2019-04-01",
    "publisher": "Pergamon",
    "doi": "https://doi.org/10.1016/j.renene.2018.10.101",
    "abstract": "Germany is a forerunner in developing renewable energies. It is therefore of considerable interest to investigate the impact of switch to renewables on the market during transition era. The aim of this study is in two parts: 1) Investigating the volatility; and 2) Conducting a descriptive study on the evolution of daily profiles and emergence of non-positive prices. In terms of volatility quantification, the following characteristics of EPEX prices should be recognized: 1) Covering the whole year (24/7); 2) Taking non-positive values; 3) Depending on calendar information; and 4) Changing according to demand and supply availability. We, therefore, propose a robust and generic approach to account for diurnal or seasonal patterns of human activities in volatility analysis. An important distinction of our work is in introducing an alternative representation (as matrices) for quasi-periodic price data. We, herein, propose a new notion of volatility using a matrix decomposition technique, namely the singular value decomposition (SVD). Our observations indicate price volatility reduction, in the recent years. The second part of this article provides evidences of effect of renewables on daily price profiles – emergence of non-positive prices and also shifts of peak price values to hours where solar is less available."
  },
  {
    "title": "Short-term scenario-based probabilistic load forecasting: A data-driven approach",
    "authors": "Abdolrahman Khoshrou, Eric J Pauwels",
    "type": "journal",
    "venue": "Applied Energy",
    "volume": "238",
    "pages": "1258--1268",
    "year": "2019",
    "date": "2019-03-01",
    "publisher": "Elsevier",
    "doi": "https://doi.org/10.1016/j.apenergy.2019.01.155",
    "abstract": "Scenario-based probabilistic forecasting models have been explored extensively in the literature in recent years. The performance of such models evidently depends to a large extent on how different input (temperature) scenarios are being generated. This paper proposes a generic framework for probabilistic load forecasting using an ensemble of regression trees. A major distinction of the current work is in using matrices as an alternative representation for quasi-periodic time series data. The singular value decomposition (SVD) technique is then used herein to generate temperature scenarios in a robust and timely manner. The strength of our proposed method lies in its simplicity and robustness, in terms of the training window size, with no need for subsetting or thresholding to generate temperature scenarios. Furthermore, to systematically account for the non-linear interactions between different variables, a new set of features is defined: the first and second derivatives of the predictors. The empirical case studies performed on the data from the load forecasting track of the Global Energy Forecasting Competition 2014 (GEFCom2014-L) show that the proposed method outperforms the top two scenario-based models with a similar set-up."
  },
  {
    "title": "Data-driven pattern identification and outlier detection in time series",
    "authors": "Abdolrahman Khoshrou, Eric J Pauwels",
    "type": "conference",
    "venue": "Advances in Intelligent Systems and Computing",
    "volume": "858",
    "pages": "471--484",
    "year": "2018",
    "date": "2018-11-02",
    "publisher": "Springer International Publishing",
    "doi": "https://doi.org/10.1007/978-3-030-01174-1_35",
    "abstract": "We address the problem of data-driven pattern identification and outlier detection in time series. To this end, we use singular value decomposition (SVD) which is a well-known technique to compute a low-rank approximation for an arbitrary matrix. By recasting the time series as a matrix it becomes possible to use SVD to highlight the underlying patterns and periodicities. This is done without the need for specifying user-defined parameters. From a data mining perspective, this opens up new ways of analyzing time series in a data-driven, bottom-up fashion. However, in order to get correct results, it is important to understand how the SVD-spectrum of a time series is influenced by various characteristics of the underlying signal and noise. In this paper, we have extended the work in earlier papers by initiating a more systematic analysis of these effects. We then illustrate our findings on some real-life data."
  },
  {
    "title": "Quantifying volatility reduction in German day-ahead spot market in the period 2006 through 2016",
    "authors": "Abdolrahman Khoshrou, Eric J Pauwels",
    "type": "conference",
    "venue": "IEEE General Meeting Power& Energy Society",
    "volume": "",
    "pages": "1--5",
    "year": "2018",
    "date": "2018-08-05",
    "publisher": "IEEE",
    "doi": "10.1109/PESGM.2018.8586020",
    "abstract": "In Europe, Germany is taking the lead in the switch from the conventional to renewable energy. This poses new challenges as wind and solar energy are fundamentally intermittent, weather-dependent and less predictable. It is therefore of considerable interest to investigate the evolution of price volatility in this post-transition era. There are a number of reasons, however, that makes the practical studies difficult. For instance, EPEX prices can be zero or negative. Consequently, the standard approach in financial time series analysis to switch to logarithmic measures is inapplicable. Furthermore, in contrast to the stock market prices which are only available for trading days, EPEX prices cover the whole year, including weekends and holidays. Accordingly, there is a lot of underlying variability in the data which has nothing to do with volatility, but simply reflects diurnal activity patterns. An important distinction of the present work is the application of matrix decomposition techniques, namely the singular value decomposition (SVD), for defining an alternative notion of volatility. This approach is systematically more robust toward outliers and also the diurnal patterns. Our observations show that the day-ahead market is becoming less volatile in recent years."
  },
  {
    "title": "SVD-based Visualisation and Approximation for Time Series Data in Smart Energy Systems",
    "authors": "Abdolrahman Khoshrou, Andre B Dorsman, Eric J Pauwels",
    "type": "conference",
    "venue": "IEEE PES Innovative Smart Grid Technologies Conference Europe (ISGT Europe)",
    "volume": "",
    "pages": "",
    "year": "2017",
    "date": "2017-09-26",
    "publisher": "IEEE",
    "doi": "10.1109/ISGTEurope.2017.8260303",
    "abstract": "Many time series in smart energy systems exhibit two different timescales. On the one hand there are patterns linked to daily human activities. On the other hand, there are relatively slow trends linked to seasonal variations. In this paper we interpret these time series as matrices, to be visualized as images. This approach has two advantages: First of all, interpreting such time series as images enables one to visually integrate across the image and makes it therefore easier to spot subtle or faint features. Second, the matrix interpretation also grants elucidation of the underlying structure using well-established matrix decomposition methods. We will illustrate both these aspects for data obtained from the German day-ahead market."
  },
  {
    "title": "Propagating uncertainty in tree-based load forecasts",
    "authors": "Abdolrahman Khoshrou, Eric J Pauwels",
    "type": "conference",
    "venue": "International Conference on Electrical and Electronics Engineering, ELECO",
    "volume": "",
    "pages": "120--124",
    "year": "2017",
    "date": "2017-11-30",
    "publisher": "IEEE",
    "doi": "",
    "abstract": "This paper discusses the use of ensembles of regression trees as a straightforward but versatile methodology to generate short term (day-ahead) load forecasts for real data from the Global Energy Forecasting Competition 2014. Since temperature is a strong predictor of load, we investigate how forecast uncertainty in temperature can affect the performance of the prediction model. To this end, a singular value decomposition (SVD) based approach is harnessed to simulate noisy but realistic temperature profiles. Our results show that as long as uncertainty is not exceedingly large, it is worthwhile to include temperature forecasts as predictors"
  },
  {
    "title": "Wide area monitoring, analysis, protection and control in smart grid using synchronized phasor measurements: a review",
    "authors": "Kaveri Bhuyan, Abdolrahman Khoshrou, Eric Pauwels",
    "type": "poster",
    "venue": "",
    "volume": "",
    "pages": "",
    "year": "2016",
    "date": "2016-01-30",
    "publisher": "",
    "doi": "",
    "abstract": ""
  },
  {
    "title": "Adaptive sampling using an unsupervised learning of GMMs applied to a fleet of AUVs with CTD measurements",
    "authors": "Abdolrahman Khoshrou, A Pedro Aguiar, Fernando Lobo Pereira",
    "type": "conference",
    "venue": "Advances in Intelligent Systems and Computing ",
    "volume": "",
    "pages": "321--332",
    "year": "2015",
    "date": "2015-12-02",
    "publisher": "Springer International Publishing",
    "doi": "https://doi.org/10.1007/978-3-319-27146-0_25",
    "abstract": "This paper addresses the problem of real-time adaptive sampling using a coordinated fleet of Autonomous Underwater Vehicles (AUVs). The system setup consists of one leader AUV and one or more follower AUVs, all equipped with conductivity, temperature and depth (CTD) sensor devices and capable of running in real-time an on-line unsupervised learning computer algorithm that uses and updates Gaussian Mixture Models (GMMs) to model the CTD data that is being acquired in real-time. The path to be traced by the leader is predefined. The followers path will depend on the CTD data. More precisely, during each resurfacing of the AUVs (and this has to be done in a coordinated fashion), every follower AUV receives the GMM hypothesis of the leader and computes the variational distance error between its own GMM and the received one. This error, that provides a notion of how different is the CTD data of each follower from the leader, is used to reconfigure the formation by scaling the distance between the AUVs in the formation (making a zoom-in and zoom-out), in order to improve the efficiency of the CTD data acquisition in a given region. The simulation results show the feasibility of the proposed strategy in uniform and more complex environments."
  },
  {
    "title": "The influence of the switch from fossil fuels to solar and wind energy on the electricity prices in Germany",
    "authors": "Andre Dorsman, Abdolrahman Khoshrou, Eric J Pauwels",
    "type": "conference",
    "venue": "",
    "volume": "",
    "pages": "",
    "year": "2016",
    "date": "2016-08-24",
    "publisher": "",
    "doi": "",
    "abstract": "Germany is actively pursuing a switch from fossil fuel to renewables, the so-called Energiewende (energy transition). Due to the fact that the supply of wind and solar energy is less predictable than the supply of fossil fuel, stabilizing the grid has become more challenging. On sunny and windy days the supply in Germany substantially exceeds demand, and the surplus needs to be exported to the neighboring countries. In this study we analyze data from the German day-ahead market in the period 2009 through 2015 and show that the realized day-ahead price experiences significant downward pressure from high predictions for the day-ahead solar and wind supply. This conclusion is based on a regression analysis using the singular value decomposition (SVD) method. SVD decomposes the time series as a sum of data-determined profiles. During the observed period the market share of solar and wind energy in the total energy supply increased in Germany. The larger the market share, the more impact solar and wind energy have."
  },
  {
    "title": "Unsupervised Learning of Gaussian Mixture Models in the Presence of Dynamic Environments: A Multiple-Model Adaptive Algorithm",
    "authors": "Abdolrahman Khoshrou, António Pedro Aguiar",
    "type": "pre-print",
    "venue": "",
    "volume": "",
    "pages": "387--396",
    "year": "2015",
    "date": "2015-01-01",
    "publisher": "Springer International Publishing",
    "doi": "",
    "abstract": ""
  },
  {
    "title": "Traffic classification and verification using unsupervised learning of Gaussian Mixture Models",
    "authors": "Hassan Alizadeh, Abdolrahman Khoshrou, Andre Zuquete",
    "type": "workshop",
    "venue": "2015 IEEE International Workshop on Measurements & Networking (M&N)",
    "volume": "",
    "pages": "1--6",
    "year": "2015",
    "date": "2015-10-12",
    "publisher": "IEEE",
    "doi": "10.1109/IWMN.2015.7322980",
    "abstract": "This paper presents the use of unsupervised Gaussian Mixture Models (GMMs) for the production of per-application models using their flows' statistics in order to be exploited in two different scenarios: (i) traffic classification, where the goal is to classify traffic flows by application (ii) traffic verification or traffic anomaly detection, where the aim is to confirm whether or not traffic flow generated by the claimed application conforms to its expected model. Unlike the first scenario, the second one is a new research path that has received less attention in the scope of Intrusion Detection System (IDS) research. The term “unsupervised” refers to the method ability to select the optimal number of components automatically without the need of careful initialization. Experiments are carried out using a public dataset collected from a real network. Favorable results indicate the effectiveness of unsupervised GMMs"
  },
  {
    "title": "Real-time unsupervised motion learning for autonomous underwater vehicles using gaussian mixture models",
    "authors": "Abdolrahman Khoshrou",
    "type": "Dissertations & Theses",
    "venue": "",
    "volume": "",
    "pages": "",
    "year": "2015",
    "date": "2015-01-12",
    "publisher": "Universidade do Porto (Portugal)",
    "doi": "https://core.ac.uk/download/pdf/143403205.pdf",
    "abstract": "Over the last decade, there has been a flurry of activity in the development of autonomous marine robotic vehicles to improve the means available for ocean exploration and exploitation. A particular scenario where Autonomous Underwater Vehicles (AUVs) can play an important role is in the automatic acquisition of marine environmental data. In this case, one or more AUVs acting in cooperation are programmed to survey a given region. To this end, an important problem that has to be addressed is the sampling motion control strategy, that is, the high-level software algorithm that is implemented on a computer system at the AUV, that decides based on the onboard sensors where (and in some cases when) to acquire environmental data. Motivated by the above, this thesis proposes a solution to solve the problem of real-time adaptive sampling using a coordinated fleet of AUVs. In the first part of the thesis, we address the online unsupervised learning problem of Gaussian mixture models (GMMs) in the presence of uncertain dynamic environments. In particular, we assume that the number of Gaussian components (clusters) is unknown and can change over time. We propose a multi-hypothesis adaptive algorithm that continuously updates the number of components and estimates the model parameters as the measurements (sample data) are being acquired. This is done by incrementally maximizing the likelihood probability associated to the estimated parameters and keeping/creating/removing in parallel a number of hypothesis models that are ranked according to the minimum description length (MDL), a well-known concept in information theory. The proposed algorithm has the additional feature that it relaxes “the sufficiently large data set” restriction by not requiring an initial batch of data. Simulation results illustrate the performance of the proposed algorithm. In the second part of the thesis, we use the proposed unsupervised algorithm to develop an adaptive sampling strategy to obtain relevant conductivity, temperature and depth (CTD) information of a given area using a coordinated fleet of AUVs. In the proposed setup, a leader AUV is tasked to acquire CTD data by running a set of user-defined mission instructions like for example following a desired path profile. The rest of the fleet (the follower AUVs) will follow the leader closely with a desired formation that will adaptively change according to the CTD data that they are acquiring. More precisely, each AUV is in charge of running in real-time the proposed unsupervised learning algorithm for GMMs that is fed by the CTD data. At each time that the vehicles resurface (and this is done in a coordinated fashion), the leader AUV broadcasts its currently estimated parameters of the GMM, and the followers based on this and their estimated GMM compute the variational distance error between these GMMs. This error, which provides a notion of how different is, from the leader, the CTD measurements that each follower is acquiring, is then used to update the next formation configuration, which typically scales the distance between the AUVs in the formation (making a zoom-in and zoom-out), in order to improve the efficiency of data acquisition in a given region. The simulation results show the feasibility and accuracy of the motion learning strategies in many uniform and complex environments."
  },
  {
    "title": "Unsupervised learning of gaussian mixture models in the presence of dynamic environments",
    "authors": "Abdolrahman Khoshrou, A Pedro Aguiar",
    "type": "conference",
    "venue": "Proceedings of the 11th Portuguese Conference on Automatic Control",
    "volume": "",
    "pages": "387--396",
    "year": "2014",
    "date": "2014-11-12",
    "publisher": "",
    "doi": "https://doi.org/10.1007/978-3-319-10380-8_37",
    "abstract": "This paper tackles the online unsupervised learning problem of Gaussian mixture models in the presence of uncertain dynamic environments. In particular, we assume that the number of Gaussian components (clusters) is unknown and can change over time. We propose a multi-hypothesis adaptive algorithm that continuously updates the number of components and estimates the model parameters as the measurements (sample data) are being acquired. This is done by incrementally maximizing the likelihood probability associated with the estimated parameters and keeping/creating/removing in parallel a number of hypothesis models that are ranked according to the minimum description length (MDL), a well-known concept in information theory. The proposed algorithm has the additional feature that it relaxes “the sufficiently large data set” restriction by not requiring in fact any initial batch of data. Simulation results illustrate the performance of the proposed algorithm."
  }
]
