[
  {
    "id": "fe40be71-dae0-4aea-96bf-6780daba3072",
    "source_type": "local",
    "source_path": "templates/projects.html",
    "title": "Majid Khoshrou - Projects",
    "text": "Majid Khoshrou - Projects Projects Below are selected projects demonstrating my work in machine learning, forecasting, and applied AI. Powering Smarter Market Forecasts — Day-Ahead Allocation at Alliander Since June 2024, I've been part of the Short-Term Energy Forecasts (STEF) team at Alliander, where I focus on improving allocation forecasts for the day-ahead energy market. By refining core models, fixing legacy bugs, and introducing high-impact predictors, I helped boost forecast accuracy by 30% — leading to over €1.3 million in annual cost savings. The outcomes of this work were integrated into OpenSTEF, Alliander's open-source forecasting library, enhancing its robustness and usability. This project directly supported the Market Services (Marketdiensten) team, enabling more data-driven decision-making in grid operations and market planning. Data-Driven Risk Modeling for Medium Voltage Grid Reliability As a Data Consultant in the Power Flow Analysis Team at Alliander in 2023, I developed a framework to assess risk across medium voltage (MV) grid routes. We analyzed and ranked available data sources to create a scoring system that identified high-risk segments. I also built statistical models to quantify reliability threats and standardized model validation practices across teams. This work enabled consistent performance tracking and informed strategic decisions on grid maintenance and targeted sensor deployment. Your browser does not support the video tag. Carbon Impact Metrics Created tools to assess the carbon footprint of server clusters, influencing sustainability reporting.",
    "external_links": {
      "OpenSTEF": "https://github.com/OpenSTEF/openstef"
    }
  },
  {
    "id": "60e400e8-7735-4bac-b38d-dad8542b01f7",
    "source_type": "local",
    "source_path": "templates/ask-mr-m.html",
    "title": "Majid Khoshrou - Ask Mr. M",
    "text": "Majid Khoshrou - Ask Mr. M Talk to Mr. M — Your AI Assistant Mr. M is Majid's custom-trained AI assistant. Curious about my research, background, or projects? Just ask! Example questions: “What are Majid’s latest publications?”, “Tell me about his work at Alliander”, “What projects has he done in energy forecasting?” Hello! I'm Mr. M, Majid’s professional AI assistant. Ask me anything about his background, work, research, or publications. Send",
    "external_links": {}
  },
  {
    "id": "07287abc-ecb0-4899-8653-ce0506e87b25",
    "source_type": "local",
    "source_path": "templates/contact.html",
    "title": "Majid Khoshrou - Contact",
    "text": "Majid Khoshrou - Contact Contact Me If you’d like to connect, discuss collaboration opportunities, or have any questions, feel free to reach out: Email: majid.khoshrou@gmail.com LinkedIn: linkedin.com/in/majid-khoshrou GitHub: github.com/majidkhoshrou",
    "external_links": {
      "linkedin.com/in/majid-khoshrou": "https://www.linkedin.com/in/majid-khoshrou-a2728349/",
      "github.com/majidkhoshrou": "https://github.com/majidkhoshrou"
    }
  },
  {
    "id": "2b2f7e27-42fc-482d-a0e1-71c13fe1b81f",
    "source_type": "local",
    "source_path": "templates/research.html",
    "title": "Majid Khoshrou - Research & Publications",
    "text": "Majid Khoshrou - Research & Publications Research & Publications Below are selected publications, loaded dynamically from structured data.",
    "external_links": {}
  },
  {
    "id": "54453cb6-ac18-42b6-87a1-723ab7b7c3c2",
    "source_type": "local",
    "source_path": "templates/index_0.html",
    "title": "Majid Khoshrou - Data Scientist",
    "text": "Majid Khoshrou - Data Scientist Welcome I am a Data Scientist with over a decade of experience applying machine learning, forecasting, and real-time analytics to solve complex challenges in energy systems, urban mobility, and sustainability. Feel free to explore my research, projects, and publications, or get in touch for collaboration opportunities. Download My CV Highlights Research & Publications Discover my peer-reviewed research in time series forecasting and smart energy systems. Learn More Projects Explore selected projects, open-source contributions, and real-world applications. View Projects Talks & Presentations See my invited talks, lectures, and recorded presentations. Watch Talks",
    "external_links": {}
  },
  {
    "id": "80a41d32-5cc7-4ce7-a1c9-3c19af16d3a3",
    "source_type": "local",
    "source_path": "templates/about.html",
    "title": "Majid Khoshrou - About Me",
    "text": "Majid Khoshrou - About Me About Me I am a Data Scientist with over a decade of combined experience in industry and academia. My work focuses on applying machine learning, forecasting, and real-time analytics to domains including energy systems, urban mobility, and sustainability. I am originally from Ghaemshahr, Mazandaran in northern Iran — a lush region by the Caspian Sea, known for its rice fields, citrus orchards, and proximity to the Alborz mountains. It’s a place where nature meets tradition, and it continues to inspire my values and curiosity. I currently live in ’s-Hertogenbosch, Netherlands, and work as a Senior Data Scientist at Alliander in Arnhem. Professional Summary Throughout my career, I have delivered solutions in time series analysis, probabilistic modeling, and anomaly detection. I am passionate about building scalable AI systems and making impactful contributions to open-source initiatives like OpenSTEF. Skills & Technologies Python, SQL, MATLAB, PySpark Machine Learning: scikit-learn, TensorFlow, PyTorch, XGBoost Cloud Platforms: AWS, GCP, Azure Data Visualization: Power BI, Tableau, Matplotlib Time Series Forecasting & Anomaly Detection Education PhD in Artificial Intelligence – CWI and Delft University of Technology (2015–2022) MSc in Information Engineering – University of Porto (2012–2015) BSc in Electrical Power Engineering – Babol Noshirvani University of Technology (2007–2011) link to a paper external source: energy forecasting paper Explore Research & Publications Peer-reviewed work in time series, forecasting, and smart energy systems. Learn More Projects Real-world applications and open-source contributions. View Projects Talks Invited talks, lectures, and recorded presentations. Watch Talks Where I'm From & Where I Live A global view connecting Ghaemshahr, Iran and ’s-Hertogenbosch, Netherlands.",
    "external_links": {
      "Ghaemshahr, Mazandaran": "https://en.wikipedia.org/wiki/Ghaemshahr",
      "’s-Hertogenbosch": "https://en.wikipedia.org/wiki/%27s-Hertogenbosch",
      "Alliander": "https://www.alliander.com/en/",
      "Arnhem": "https://en.wikipedia.org/wiki/Arnhem",
      "OpenSTEF": "https://github.com/OpenSTEF/openstef",
      "energy forecasting paper": "https://pure.tudelft.nl/ws/files/56847223/Applied_Energy_LSBoosting_LoadForecast_002_.pdf"
    }
  },
  {
    "id": "a288ecbd-a424-4adc-9a65-c3835c0f1f46",
    "source_type": "local",
    "source_path": "templates/talks.html",
    "title": "Majid Khoshrou - Talks",
    "text": "Majid Khoshrou - Talks Talks & Presentations Here you can find selected talks and presentations I have delivered. PhD Defense – Singular Value Decomposition for Time Series Analysis in Smart Energy Systems Your browser does not support the video tag. Defense date: December 19, 2022 Institution: Delft University of Technology & Centrum Wiskunde & Informatica Upcoming / Recent Talks Below is a placeholder for future talks and presentations. As more events occur, I will update this section with recordings, slides, and summaries. Biweekly stakeholder meetings (internal, not recorded). Future invited seminars and webinars.",
    "external_links": {}
  },
  {
    "id": "db750c94-f6e0-4256-9216-2ca09c2f2381",
    "source_type": "local",
    "source_path": "templates/analytics.html",
    "title": "Majid Khoshrou - Analytics",
    "text": "Majid Khoshrou - Analytics Visitor Analytics Total Visits: Loading... VPN Users: ... | Unknown Country: ... Visitor Locations Daily Visits Device Types",
    "external_links": {}
  },
  {
    "id": "7f966f81-61ce-4c8a-8fa2-b814c83edc6c",
    "source_type": "local",
    "source_path": "templates/projects copy.html",
    "title": "Majid Khoshrou - Data Scientist",
    "text": "Majid Khoshrou - Data Scientist Projects Below are selected projects demonstrating my work in machine learning, forecasting, and applied AI. OpenSTEF Open-source energy forecasting library used to improve allocation forecasts and reduce costs in smart grids. View Project EV Charging Demand Forecasting Developed predictive models supporting infrastructure planning for electric vehicle charging networks. Carbon Impact Metrics Created tools to assess the carbon footprint of server clusters, influencing sustainability reporting.",
    "external_links": {
      "View Project": "https://github.com/OpenSTEF/openstef"
    }
  },
  {
    "id": "0e3c99d1-1010-488a-8998-bb8e52674c4d",
    "source_type": "local",
    "source_path": "templates/index.html",
    "title": "Majid Khoshrou - Home",
    "text": "Majid Khoshrou - Home Hello & Welcome I'm Majid — a Data Scientist passionate about leveraging machine learning, forecasting, and real-time analytics to create sustainable and intelligent systems. 🔹 10+ years in data science (industry + academia) 🔹 Specializing in energy systems, urban mobility, and AI 🔹 Open-source contributor to OpenSTEF 🔹 PhD from TU Delft & CWI Download CV Contact Me Explore Research & Publications Peer-reviewed work in time series, forecasting, and smart energy systems. Learn More Projects Real-world applications and open-source contributions. View Projects Talks Invited talks, lectures, and recorded presentations. Watch Talks",
    "external_links": {}
  }
]